# FabricSheetMajorReinforcementArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetMajorReinforcementArea Property
ParameterTypeId Class See Also
---
"Major Reinforcement Area": Major Reinforcement Area
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetMajorReinforcementArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetMajorReinforcementArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetMajorReinforcementArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace